Key Features of Pandas

Fast and efficient DataFrame object with default and customized indexing.

Tools for loading data into in-memory data objects from different file formats.

Data alignment and integrated handling of missing data.

Reshaping and pivoting of date sets.

Label-based slicing, indexing and subsetting of large data sets.

Columns from a data structure can be deleted or inserted.

Group by data for aggregation and transformations.

High performance merging and joining of data.

Time Series functionality.

In [1]:
import pandas as pd
import numpy as np

Pandas deals with the following three data structures −

1.Series-1D labeled 
-Homogeneous data
-Size Immutable
-Values of Data Mutable

2.DataFrame-General 2D labeled, 
-size mutable 
-data mutable
-with potentially heterogeneously typed columns.

3.Panel-General 3D labeled, 
-Heterogeneous data
-Size Mutable
-Data Mutable

In [2]:
#series
a=pd.Series()
a

<ipython-input-2-82cc2e36889f>:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a=pd.Series()

Series([], dtype: float64)

In [3]:

b=pd.Series([100,200,300,400,500,600,700,800,9,10])
b
#create index for data

0    100
1    200
2    300
3    400
4    500
5    600
6    700
7    800
8      9
9     10
dtype: int64

# DATAFRAME

In [4]:
#converting dictionary to dataframe
dict={'A':[1,2,3] , 'B':[4,5,6] , 'C':[7,8,9] }
df=pd.DataFrame(dict)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [5]:
#adding coloumn to dataframe
df['States']="AB CD EF".split()
df

#split will split the data based on the spaces

   A  B  C States
0  1  4  7     AB
1  2  5  8     CD
2  3  6  9     EF

In [6]:
#creating Nan values and manipulation
dict1={'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[4,7,20]}
df1=pd.DataFrame(dict1)
df1


#We add nan(not a number) using np.nan

     A    B   C
0  1.0  5.0   4
1  2.0  NaN   7
2  NaN  NaN  20

In [7]:
#dropping a coloumn with Nan Value
print(df1.dropna(axis=1))

#axis=1-->coloumn

    C
0   4
1   7
2  20

In [8]:
#dropping a row with nan value
print(df1.dropna(axis=0))

     A    B  C
0  1.0  5.0  4

In [9]:
df1

     A    B   C
0  1.0  5.0   4
1  2.0  NaN   7
2  NaN  NaN  20

In [10]:
#filling Nan values with default value
print(df1.fillna(value=20))

      A     B   C
0   1.0   5.0   4
1   2.0  20.0   7
2  20.0  20.0  20

In [11]:
#filling the nan values with mean of coloumn A
print(df1.fillna(value=df1['A'].mean()))

     A    B   C
0  1.0  5.0   4
1  2.0  1.5   7
2  1.5  1.5  20

# GROUPBY

By “group by” we are referring to a process involving one or more of the following steps:Splitting the data into groups based on some criteria.Applying a function to each group independently.

Combining the results into a data structure.Out of these, the split step is the most straightforward. In fact, in many situations we may wish to split the data set into groups and do something with those groups. In the apply step, we might wish to do one of the following:

In [12]:
import pandas as pd
data = {
  "calories": [420, 380, 390,233],
  "duration": [50, 40, 45,42],
    "reps":[20,32,42,23]
}

In [13]:
#converting the data into dataframe
df2=pd.DataFrame(data)
df2

   calories  duration  reps
0       420        50    20
1       380        40    32
2       390        45    42
3       233        42    23

In [14]:
#grouping 
bycalorie=df2.groupby('calories')

In [15]:
#finding mean
print(bycalorie.mean())

          duration  reps
calories
233             42    23
380             40    32
390             45    42
420             50    20

In [16]:
#finding sum
print(bycalorie.sum())

          duration  reps
calories
233             42    23
380             40    32
390             45    42
420             50    20

# MERGING DATAFRAME

In [17]:
df4=pd.DataFrame({"calories": [420, 380, 390,233], "duration": [50, 40, 45,42], "reps":[20,32,42,23]},index=[0,1,2,3])

In [18]:
df4

   calories  duration  reps
0       420        50    20
1       380        40    32
2       390        45    42
3       233        42    23

In [19]:
df5=pd.DataFrame({"calories": [420, 380, 390,233], "duration": [50, 40, 45,42], "reps":[20,32,42,23]},index=[4,5,6,7])

In [20]:
dfconcat=pd.concat([df4,df5],axis=0)
dfconcat

   calories  duration  reps
0       420        50    20
1       380        40    32
2       390        45    42
3       233        42    23
4       420        50    20
5       380        40    32
6       390        45    42
7       233        42    23

In [21]:
dfconcat1=pd.concat([df4,df5],axis=1)
dfconcat1

   calories  duration  reps  calories  duration  reps
0     420.0      50.0  20.0       NaN       NaN   NaN
1     380.0      40.0  32.0       NaN       NaN   NaN
2     390.0      45.0  42.0       NaN       NaN   NaN
3     233.0      42.0  23.0       NaN       NaN   NaN
4       NaN       NaN   NaN     420.0      50.0  20.0
5       NaN       NaN   NaN     380.0      40.0  32.0
6       NaN       NaN   NaN     390.0      45.0  42.0
7       NaN       NaN   NaN     233.0      42.0  23.0

In [22]:
dfconcat1.fillna(value=0,inplace=True)

#inplace=true means the changes made should be permanent

# MERGING DATAFRAME BY A COMMON KEY

Inner join is the most common type of join you’ll be working with. It returns a dataframe with only those rows that have common characteristics.

Full Join, also known as Full Outer Join, returns all those records which either have a match in the left or right dataframe.

Left join, also known as Left Outer Join, returns a dataframe containing all the rows of the left dataframe.

Right join, also known as Right Outer Join, is similar to the Left Outer Join. The only difference is that all the rows of the right dataframe are taken as it is and only those of the left dataframe that are common in both.

In [23]:
data1 = {
  'key':['k1','k2','k3','k4'],
  "duration1":[50, 40, 45,42],
 "reps1":[20,39,29,39]
}
 
data2={
  'key':['k1','k2','k3','k4'],
  "dur": [53,45,34,35],
    "re":[20,32,42,23]
}

left=pd.DataFrame(data1)
right=pd.DataFrame(data2)

print(left)
print(right)

  key  duration1  reps1
0  k1         50     20
1  k2         40     39
2  k3         45     29
3  k4         42     39
  key  dur  re
0  k1   53  20
1  k2   45  32
2  k3   34  42
3  k4   35  23

In [24]:
#merge
merge1=pd.merge(left,right,how='inner',on='key')
merge1

#while merging if keys dont match, then they dont merge

  key  duration1  reps1  dur  re
0  k1         50     20   53  20
1  k2         40     39   45  32
2  k3         45     29   34  42
3  k4         42     39   35  23

In [25]:
#join

#he join method works best when we are joining dataframes on their indexes 
#(though you can specify another column to join on for the left dataframe).

data3 = {
  "duration1":[50, 40, 45,42],
 "reps1":[20,39,29,39]
}
 
data4={
   "duration1":[50, 40, 45,42],
 "reps1":[20,39,29,39]
}

right1=pd.DataFrame(data2,index=[0,1,2,3])
left1=pd.DataFrame(data1,index=[0,1,2,3])

In [26]:
right1

  key  dur  re
0  k1   53  20
1  k2   45  32
2  k3   34  42
3  k4   35  23

In [27]:
left1

  key  duration1  reps1
0  k1         50     20
1  k2         40     39
2  k3         45     29
3  k4         42     39

In [28]:
left1.join(right1,how='outer')
    
#the left should be as it is
#the right should be joined to left

ValueError: columns overlap but no suffix specified: Index(['key'], dtype='object')

# USING FUNCTION INSIDE DATAFRAME

In [ ]:
#creating a new coloumn using function output
def testfunc(x):
    if x>5:
        return(x-1)
    else:
        return(x+1)
    
df10=pd.DataFrame({'col1':[1,2,3,4,5,6,7],'col2':[10,20,30,40,50,60,70],'col3':[100,200,300,400,500,600,700]})

df10['Funcapplied']=df10['col1'].apply(testfunc)
df10

In [ ]:
#creating a new colomn using a inbuilt function
    
df11=pd.DataFrame({'col3':['aa','bbb','cc','dd','eeee','fff','gggg']})

df11['col3length']=df11['col3'].apply(len)

df11

You define a function that will take the column values you want to play with to come up with your logic. Here the only two columns we end up using are genre and rating.
You use an apply function with lambda along the row with axis=1. 

The general syntax is:
df['functionName'].apply(lambda x: function(x) )

In [40]:
#using a function output coloumn as input for next output
df12=pd.DataFrame({'col1':[1,2,3,4,5,6,7],'col2':[10,20,30,40,50,60,70],'col3':[100,200,300,400,500,600,700]})
def testfunc(x):
    if x>5:
        return(x-1)
    else:
        return(x+1)
    
df12['Funcapplied']=df12['col1'].apply(testfunc)
df12

df12['Funcapplied'].apply(lambda x: np.sqrt(x) )

0    1.414214
1    1.732051
2    2.000000
3    2.236068
4    2.449490
5    2.236068
6    2.449490
Name: Funcapplied, dtype: float64

In [ ]:
print(df12['Funcapplied'].sum())

In [37]:
print(df12['Funcapplied'].min())

2

In [38]:
print(df12['Funcapplied'].max())

6


# COLUMN

In [41]:
df12=pd.DataFrame({'col1':[1,2,3,4,5,6,7],'col2':[10,20,30,40,50,60,70],'col3':[100,200,300,400,500,600,700]})

#PRINT COLOUMNS IN DATAFRAME
print(df12.columns)

Index(['col1', 'col2', 'col3'], dtype='object')

In [45]:
#converting column names into a list
l=list(df12.columns)
print(l)

['col1', 'col2', 'col3']

In [46]:
#deleting a column
del df12['col1']
df12

   col2  col3
0    10   100
1    20   200
2    30   300
3    40   400
4    50   500
5    60   600
6    70   700

# SORTING VALUES IN COLUMN

In [49]:
df14=pd.DataFrame({'col1':[1,2,3,4,5,6,7],'col2':[100,90,80,70,60,50,40],'col3':[100,200,300,400,500,600,700]})
df14.sort_values(by='col2') #inplace=false in default

   col1  col2  col3
6     7    40   700
5     6    50   600
4     5    60   500
3     4    70   400
2     3    80   300
1     2    90   200
0     1   100   100

In [50]:
#for decreasing
df14.sort_values(by='col2',ascending=False)

   col1  col2  col3
0     1   100   100
1     2    90   200
2     3    80   300
3     4    70   400
4     5    60   500
5     6    50   600
6     7    40   700

# Finding null values

In [61]:
dict2={'email':['aneeshabsoman@gmail.com','aneeshabsoman123@Gmail.com',np.nan], 'phonenumber':[5,np.nan,np.nan], 'age':[4,7,20]}
df15=pd.DataFrame(dict2)
df15

                        email  phonenumber  age
0     aneeshabsoman@gmail.com          5.0    4
1  aneeshabsoman123@Gmail.com          NaN    7
2                         NaN          NaN   20

In [62]:
#number of null values in each column
df15.isnull().sum()

email          1
phonenumber    2
age            0
dtype: int64

In [63]:
#fill the null values
df15.fillna("aneesha")

                        email phonenumber  age
0     aneeshabsoman@gmail.com           5    4
1  aneeshabsoman123@Gmail.com     aneesha    7
2                     aneesha     aneesha   20

# READING CSV FILE

In [64]:
ipl=pd.read_csv('test.csv')

In [65]:
ipl.tail(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [66]:
ipl.sample(n=10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
149,1041,2,"Lahtinen, Rev. William",male,30.0,1,1,250651,26.0000,NaN,S
16,908,2,"Keane, Mr. Daniel",male,35.0,0,0,233734,12.3500,NaN,Q
267,1159,3,"Warren, Mr. Charles William",male,NaN,0,0,C.A. 49867,7.5500,NaN,S
394,1286,3,"Kink-Heilmann, Mr. Anton",male,29.0,3,1,315153,22.0250,NaN,S
195,1087,3,"Karlsson, Mr. Julius Konrad Eugen",male,33.0,0,0,347465,7.8542,NaN,S
254,1146,3,"Wenzel, Mr. Linhart",male,32.5,0,0,345775,9.5000,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
27,919,3,"Daher, Mr. Shedid",male,22.5,0,0,2698,7.2250,NaN,C
147,1039,3,"Davies, Mr. Evan",male,22.0,0,0,SC/A4 23568,8.0500,NaN,S
298,1190,1,"Loring, Mr. Joseph Holland",male,30.0,0,0,113801,45.5000,NaN,S

In [67]:
type(ipl)

pandas.core.frame.DataFrame

In [68]:
ipl.shape

(418, 11)

# EXPORTING DATA INTO CSV FILE

In [69]:
#creating new file in desktop
ipl.to_csv('aneesha.csv')

while exporting if we dont want index, then we can make it false

# READING FROM EXCEL FILE
ipl=pd.read_excel('test.xlsx',sheet_name='Sheet2')

# READING FROM HTML

url="link.html"
data=pd.read_html(url)